000018161209             DCL        VAR(&PATH) TYPE(*CHAR) LEN(100)
000019161209             DCL        VAR(&CODE) TYPE(*CHAR) LEN(10) VALUE('PATH')
000020161209             DCL        VAR(&SUBCODE) TYPE(*CHAR) LEN(10) VALUE(' ')
000021161209             CALLPRC    PRC(GETPARM2) PARM((&CODE *BYVAL) (&SUBCODE +
000022161209                          *BYVAL)) RTNVAL(&PATH)
000023161209             CHGVAR     VAR(&PATH) VALUE(&PATH *TCAT '*')
000024161209             WRKLNK     OBJ(&PATH)
